bricks/olymp/olymp/ejik/2013.org
#+HTML_DOCTYPE: html5
#+OPTIONS: toc:nil num:nil html5-fancy:t
#+MACRO: begin-block #+HTML: <div class="$1">
#+MACRO: end-block #+HTML: </div>

{{{begin-block(Page)}}}

* Первая командная олимпиада по программированию Ёjik

*28 сентября 2013 года* состоится командная олимпиада по
программированию для начинающих Ёjik (произносится «ёжик»).  Это
командное соревнование, которое проводится в один компьютерный тур
продолжительностью 3 часа. Команде из трёх человек предоставляется
один персональный компьютер и предлагается решить несколько задач. Для
решения участники могут использовать следующие языки программирования:
C/C++, C#, Java, Pascal, Python.

Задачи олимпиады рассчитаны на самый широкий круг участников: они в
большинстве своем не требуют знаний математики, выходящих за рамки
программы 6-7 класса, а также доступны школьникам, не овладевшим
целиком основами языка программирования (например, школьникам, не
владеющим строками или двумерными массивами, будут доступны
большинство задач).

** Результаты

Первая олимпиада Ёjik состоялась! В олимпиаде приняло участие 18
команд из Кирова, Кирово-Чепецка и Слободского. Всего было 50
школьников. Спасибо вам! Победителями стали:

1. КЭПЛ #1 (Фролова Анна 11, Тупий Екатерина 11)
2. КФМЛ, АМА (Ашихмин Анатолий 7, Шутов Максим 7, Щенников Григорий 7)
3. КЛЕН, Talking Hamsters (Исупова Юлия 11, Похвищева Надежда 11, Гасников Евгений 11)

Итоговая таблица:

|-----+----------------------------+-------+-------+-------+-----+-------+-----+-----+-----+--------+-------+-------|
|     | Команда                    | A     | B     | C     | D   | E     | F   | G   | H   | Задачи | Баллы | Место |
|-----+----------------------------+-------+-------+-------+-----+-------+-----+-----+-----+--------+-------+-------|
| <r> | <l>                        | <c>   | <c>   | <c>   | <c> | <c>   | <c> | <c> | <c> |    <c> |   <c> |   <c> |
| 002 | КЭПЛ - 1                   | *100* | *100* | 62    | 62  | *96*  | 56  | 0   |     |      3 |   476 |     1 |
| 018 | AMA (КФМЛ)                 | *100* | *99*  | 72    | 16  | *100* | 48  | 0   | 0   |      3 |   435 |     2 |
| 001 | Talking Hamsters (КЛЕН)    | *100* | *100* | *100* | 32  | *99*  |     |     |     |      4 |   431 |     3 |
| 016 | Команда 3 (Школа №28)      | *100* | *100* | 44    | 32  | *99*  | 48  |     | 0   |      3 |   423 |     4 |
| 006 | Лицей 1 (г. Кирово-Чепецк) | *100* | *98*  | 60    | 40  | 63    | 40  | 4   | 0   |      2 |   405 |     5 |
| 007 | Лицей 2 (г. Кирово-Чепецк) | *100* | *100* | 73    | 24  | 72    |     |     |     |      2 |   369 |     6 |
| 012 | ТриПаскаль (КЛЕН)          | *100* | *100* | *98*  |     |       | 40  | 0   |     |      3 |   338 |     7 |
| 003 | КЭПЛ - 2                   | *100* | *100* | 70    |     | 16    | 40  |     |     |      2 |   326 |     8 |
| 009 | Лицей 4 (г. Кирово-Чепецк) | 36    | *100* | 44    |     | *99*  | 40  |     |     |      2 |   319 |     9 |
| 011 | Лицей №9 (г. Слободской)   | *100* | *100* | 44    |     | 64    |     |     |     |      2 |   308 |    10 |
| 005 | dood (Школа №30)           | *100* | 0     | 43    |     | *100* | 40  |     |     |      2 |   283 |    11 |
| 015 | Pilots (Школа №28)         | *100* | *100* | 44    | 31  |       |     | 0   |     |      2 |   275 |    12 |
| 010 | Superhero (КЛЕН)           | *100* | 32    | 44    | 0   |       | 40  |     |     |      1 |   216 |    13 |
| 008 | Лицей 3 (г. Кирово-Чепецк) | *100* |       | 63    |     | 16    |     |     |     |      1 |   179 |    14 |
| 017 | Random (КФМЛ)              | *100* |       | 44    |     |       |     | 24  |     |      1 |   168 |    15 |
| 004 | Школа №40                  | 39    | 72    |       | 31  |       |     |     |     |      0 |   142 |    16 |
| 014 | SFK (Школа №28)            | 72    | 24    | 44    |     |       |     |     |     |      0 |   140 |    17 |
| 013 | Умные ребята (КФМЛ)        | *100* | 24    | 0     | 0   |       |     |     |     |      1 |   124 |    18 |
|-----+----------------------------+-------+-------+-------+-----+-------+-----+-----+-----+--------+-------+-------|

** Материалы

+ [[./2013-statements.pdf][Условия задач]]
+ [[./2013-jury.7z][Архив жюри с решениями всех задач]]
+ [[./2013-runs.7z][Архив подходов участников]]

** Место проведения

КОГОАУ «Кировский физико-математический лицей», г. Киров, ул. Труда 16.

** Расписание

*28 сентября:*

+ 14:00 - 14:15 :: открытие, объяснение правил
+ 14:30 - 17:30 :: cоревнование
+ 17:30 :: подведение итогов

** Жюри олимпиады

+ Будин Николай Алексеевич, ФМЛ, г. Киров
+ Бураков Иван Александрович, Лицей, г. Кирово-Чепецк
+ Кайсин Илья Сергеевич, ФМЛ, г. Киров
+ Латышев Алексей Сергеевич, НИУ ИТМО, г. Санкт-Петербург
+ Пестов Олег Александрович, ФМЛ, г. Киров

** Организационный комитет

+ Пестов Олег Александрович, ФМЛ, г. Киров
+ Щепин Тимофей Аркадьевич, ФМЛ, г. Киров
+ Ямбарышева Светлана Юрьевна, ФМЛ, г. Киров

** Контакты

Пестов Олег Александрович, +7(909)143-5774, ~oleg.pestov@gmail.com~.

{{{end-block}}}
