bricks/olymp/olymp/ejik/2013.html
<div class="Page">

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Первая командная олимпиада по программированию Ёjik</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>28 сентября 2013 года</b> состоится командная олимпиада по
программированию для начинающих Ёjik (произносится «ёжик»).  Это
командное соревнование, которое проводится в один компьютерный тур
продолжительностью 3 часа. Команде из трёх человек предоставляется
один персональный компьютер и предлагается решить несколько задач. Для
решения участники могут использовать следующие языки программирования:
C/C++, C#, Java, Pascal, Python.
</p>

<p>
Задачи олимпиады рассчитаны на самый широкий круг участников: они в
большинстве своем не требуют знаний математики, выходящих за рамки
программы 6-7 класса, а также доступны школьникам, не овладевшим
целиком основами языка программирования (например, школьникам, не
владеющим строками или двумерными массивами, будут доступны
большинство задач).
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Результаты</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Первая олимпиада Ёjik состоялась! В олимпиаде приняло участие 18
команд из Кирова, Кирово-Чепецка и Слободского. Всего было 50
школьников. Спасибо вам! Победителями стали:
</p>

<ol class="org-ol">
<li>КЭПЛ #1 (Фролова Анна 11, Тупий Екатерина 11)
</li>
<li>КФМЛ, АМА (Ашихмин Анатолий 7, Шутов Максим 7, Щенников Григорий 7)
</li>
<li>КЛЕН, Talking Hamsters (Исупова Юлия 11, Похвищева Надежда 11, Гасников Евгений 11)
</li>
</ol>

<p>
Итоговая таблица:
</p>

<table>


<colgroup>
<col  class="right">

<col  class="left">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="right">&#xa0;</th>
<th scope="col" class="left">Команда</th>
<th scope="col" class="center">A</th>
<th scope="col" class="center">B</th>
<th scope="col" class="center">C</th>
<th scope="col" class="center">D</th>
<th scope="col" class="center">E</th>
<th scope="col" class="center">F</th>
<th scope="col" class="center">G</th>
<th scope="col" class="center">H</th>
<th scope="col" class="center">Задачи</th>
<th scope="col" class="center">Баллы</th>
<th scope="col" class="center">Место</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">002</td>
<td class="left">КЭПЛ - 1</td>
<td class="center"><b>100</b></td>
<td class="center"><b>100</b></td>
<td class="center">62</td>
<td class="center">62</td>
<td class="center"><b>96</b></td>
<td class="center">56</td>
<td class="center">0</td>
<td class="center"> </td>
<td class="center">3</td>
<td class="center">476</td>
<td class="center">1</td>
</tr>

<tr>
<td class="right">018</td>
<td class="left">AMA (КФМЛ)</td>
<td class="center"><b>100</b></td>
<td class="center"><b>99</b></td>
<td class="center">72</td>
<td class="center">16</td>
<td class="center"><b>100</b></td>
<td class="center">48</td>
<td class="center">0</td>
<td class="center">0</td>
<td class="center">3</td>
<td class="center">435</td>
<td class="center">2</td>
</tr>

<tr>
<td class="right">001</td>
<td class="left">Talking Hamsters (КЛЕН)</td>
<td class="center"><b>100</b></td>
<td class="center"><b>100</b></td>
<td class="center"><b>100</b></td>
<td class="center">32</td>
<td class="center"><b>99</b></td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">4</td>
<td class="center">431</td>
<td class="center">3</td>
</tr>

<tr>
<td class="right">016</td>
<td class="left">Команда 3 (Школа №28)</td>
<td class="center"><b>100</b></td>
<td class="center"><b>100</b></td>
<td class="center">44</td>
<td class="center">32</td>
<td class="center"><b>99</b></td>
<td class="center">48</td>
<td class="center"> </td>
<td class="center">0</td>
<td class="center">3</td>
<td class="center">423</td>
<td class="center">4</td>
</tr>

<tr>
<td class="right">006</td>
<td class="left">Лицей 1 (г. Кирово-Чепецк)</td>
<td class="center"><b>100</b></td>
<td class="center"><b>98</b></td>
<td class="center">60</td>
<td class="center">40</td>
<td class="center">63</td>
<td class="center">40</td>
<td class="center">4</td>
<td class="center">0</td>
<td class="center">2</td>
<td class="center">405</td>
<td class="center">5</td>
</tr>

<tr>
<td class="right">007</td>
<td class="left">Лицей 2 (г. Кирово-Чепецк)</td>
<td class="center"><b>100</b></td>
<td class="center"><b>100</b></td>
<td class="center">73</td>
<td class="center">24</td>
<td class="center">72</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">369</td>
<td class="center">6</td>
</tr>

<tr>
<td class="right">012</td>
<td class="left">ТриПаскаль (КЛЕН)</td>
<td class="center"><b>100</b></td>
<td class="center"><b>100</b></td>
<td class="center"><b>98</b></td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">40</td>
<td class="center">0</td>
<td class="center"> </td>
<td class="center">3</td>
<td class="center">338</td>
<td class="center">7</td>
</tr>

<tr>
<td class="right">003</td>
<td class="left">КЭПЛ - 2</td>
<td class="center"><b>100</b></td>
<td class="center"><b>100</b></td>
<td class="center">70</td>
<td class="center"> </td>
<td class="center">16</td>
<td class="center">40</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">326</td>
<td class="center">8</td>
</tr>

<tr>
<td class="right">009</td>
<td class="left">Лицей 4 (г. Кирово-Чепецк)</td>
<td class="center">36</td>
<td class="center"><b>100</b></td>
<td class="center">44</td>
<td class="center"> </td>
<td class="center"><b>99</b></td>
<td class="center">40</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">319</td>
<td class="center">9</td>
</tr>

<tr>
<td class="right">011</td>
<td class="left">Лицей №9 (г. Слободской)</td>
<td class="center"><b>100</b></td>
<td class="center"><b>100</b></td>
<td class="center">44</td>
<td class="center"> </td>
<td class="center">64</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">308</td>
<td class="center">10</td>
</tr>

<tr>
<td class="right">005</td>
<td class="left">dood (Школа №30)</td>
<td class="center"><b>100</b></td>
<td class="center">0</td>
<td class="center">43</td>
<td class="center"> </td>
<td class="center"><b>100</b></td>
<td class="center">40</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">283</td>
<td class="center">11</td>
</tr>

<tr>
<td class="right">015</td>
<td class="left">Pilots (Школа №28)</td>
<td class="center"><b>100</b></td>
<td class="center"><b>100</b></td>
<td class="center">44</td>
<td class="center">31</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">0</td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">275</td>
<td class="center">12</td>
</tr>

<tr>
<td class="right">010</td>
<td class="left">Superhero (КЛЕН)</td>
<td class="center"><b>100</b></td>
<td class="center">32</td>
<td class="center">44</td>
<td class="center">0</td>
<td class="center"> </td>
<td class="center">40</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">1</td>
<td class="center">216</td>
<td class="center">13</td>
</tr>

<tr>
<td class="right">008</td>
<td class="left">Лицей 3 (г. Кирово-Чепецк)</td>
<td class="center"><b>100</b></td>
<td class="center"> </td>
<td class="center">63</td>
<td class="center"> </td>
<td class="center">16</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">1</td>
<td class="center">179</td>
<td class="center">14</td>
</tr>

<tr>
<td class="right">017</td>
<td class="left">Random (КФМЛ)</td>
<td class="center"><b>100</b></td>
<td class="center"> </td>
<td class="center">44</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">24</td>
<td class="center"> </td>
<td class="center">1</td>
<td class="center">168</td>
<td class="center">15</td>
</tr>

<tr>
<td class="right">004</td>
<td class="left">Школа №40</td>
<td class="center">39</td>
<td class="center">72</td>
<td class="center"> </td>
<td class="center">31</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">0</td>
<td class="center">142</td>
<td class="center">16</td>
</tr>

<tr>
<td class="right">014</td>
<td class="left">SFK (Школа №28)</td>
<td class="center">72</td>
<td class="center">24</td>
<td class="center">44</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">0</td>
<td class="center">140</td>
<td class="center">17</td>
</tr>

<tr>
<td class="right">013</td>
<td class="left">Умные ребята (КФМЛ)</td>
<td class="center"><b>100</b></td>
<td class="center">24</td>
<td class="center">0</td>
<td class="center">0</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">1</td>
<td class="center">124</td>
<td class="center">18</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Материалы</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="./2013-statements.pdf">Условия задач</a>
</li>
<li><a href="./2013-jury.7z">Архив жюри с решениями всех задач</a>
</li>
<li><a href="./2013-runs.7z">Архив подходов участников</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Место проведения</h3>
<div class="outline-text-3" id="text-1-3">
<p>
КОГОАУ «Кировский физико-математический лицей», г. Киров, ул. Труда 16.
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Расписание</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<b>28 сентября:</b>
</p>

<dl class="org-dl">
<dt> 14:00 - 14:15 </dt><dd>открытие, объяснение правил
</dd>
<dt> 14:30 - 17:30 </dt><dd>cоревнование
</dd>
<dt> 17:30 </dt><dd>подведение итогов
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Жюри олимпиады</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Будин Николай Алексеевич, ФМЛ, г. Киров
</li>
<li>Бураков Иван Александрович, Лицей, г. Кирово-Чепецк
</li>
<li>Кайсин Илья Сергеевич, ФМЛ, г. Киров
</li>
<li>Латышев Алексей Сергеевич, НИУ ИТМО, г. Санкт-Петербург
</li>
<li>Пестов Олег Александрович, ФМЛ, г. Киров
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Организационный комитет</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Пестов Олег Александрович, ФМЛ, г. Киров
</li>
<li>Щепин Тимофей Аркадьевич, ФМЛ, г. Киров
</li>
<li>Ямбарышева Светлана Юрьевна, ФМЛ, г. Киров
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">Контакты</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Пестов Олег Александрович, +7(909)143-5774, <code>oleg.pestov@gmail.com</code>.
</p>

</div>
</div>
</div>
</div>
